// 1. В заданной матрице A(n, m) поменять местами строки с номерами p и q.
#include <iostream>
using namespace	std;
int main() {
	setlocale(LC_CTYPE, "rus");
	cout << " 1. В заданной матрице A(n, m) поменять местами строки с номерами p и q.\n\n";
	int A[3][3] = { {54, 23, 87},
							{23, 46, 46},
							{94, 45, 43}
	};
	int B[3];
	cout << "Вывод данной матрицы\n";
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << A[i][j] << " ";
		}
		cout << endl;
	}
	cout << "\nматрица после замены 3 на 1 и 1 на 3 строку\n";
	B[0] = A[0][0];
	B[1] = A[0][1];
	B[2] = A[0][2];

	A[0][0] = A[2][0];
	A[0][1] = A[2][1];
	A[0][2] = A[2][2];

	A[2][0] = B[0];
	A[2][1] = B[1];
	A[2][2] = B[2];
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << A[i][j] << " ";
		}
		cout << endl;
	}
}